
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РезервированиеТовара") Тогда
		Склад = ДанныеЗаполнения.Склад;
		ДокументРезервирования = ДанныеЗаполнения;
		Для Каждого ТекСтрокаЗарезервированныеТовары Из ДанныеЗаполнения.ЗарезервированныеТовары Цикл
			НоваяСтрока = ТоварыДляСписания.Добавить();
			НоваяСтрока.Количество = ТекСтрокаЗарезервированныеТовары.Количество;
			НоваяСтрока.НаименованиеТовара = ТекСтрокаЗарезервированныеТовары.НаименованиеТовара;
			НоваяСтрока.Цена = ТекСтрокаЗарезервированныеТовары.Цена;
			НоваяСтрока.Сумма = ТекСтрокаЗарезервированныеТовары.Сумма;
			Сумма = Сумма + ТекСтрокаЗарезервированныеТовары.Сумма;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиТоваров.Записывать = Истина; 
	
	Для Каждого ТекСтрокаТоварыДляСписания Из ТоварыДляСписания Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Товар = ТекСтрокаТоварыДляСписания.НаименованиеТовара;
		Если ДокументРезервирования.Проведен Тогда
			Движение.Зарезервировано = ТекСтрокаТоварыДляСписания.Количество;
			Движение.Количество = ТекСтрокаТоварыДляСписания.Количество;
		иначе 
			Движение.Количество = ТекСтрокаТоварыДляСписания.Количество;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 

//Процедура РасчетСуммы(число) экспорт
//	Сумма = Сумма + число;
//КонецПроцедуры
