 
 &НаСервере
 Функция ЗарезервированныеТоварыКоличествоПриИзмененииНаСервере(ТоварДляПоиска, КоличествоДляРезерва,СкладДляРезервирования)
	 Запрос = Новый Запрос;
	 Запрос.Текст =
	 "ВЫБРАТЬ
	 |	ОстаткиТоваровОстатки.Товар КАК Товар,
	 |	ОстаткиТоваровОстатки.КоличествоОстаток КАК НаСкладе,
	 |	ОстаткиТоваровОстатки.ЗарезервированоОстаток КАК Зарезервировано
	 |ИЗ
	 |	РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
	 |ГДЕ
	 |	ОстаткиТоваровОстатки.Товар.Ссылка = &Товар
	 |	И ОстаткиТоваровОстатки.Склад = &Склад";
	 
	 Запрос.УстановитьПараметр("Товар",ТоварДляПоиска);
	 Запрос.УстановитьПараметр("Склад",СкладДляРезервирования);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 ТаблицаИзЗапроса = РезультатЗапроса.Выгрузить();
	 ВсегоТовараНаСкладе = ТаблицаИзЗапроса.Итог("НаСкладе");
	 ВсегоТовараЗарезервировано = ТаблицаИзЗапроса.Итог("Зарезервировано");
	 СвободныйТовар = ВсегоТовараНаСкладе-ВсегоТовараЗарезервировано;
	 
	 Если СвободныйТовар <КоличествоДляРезерва Тогда
		 Сообщить("Недостатовно товара для создания резерва, свободного товара на складе осталось " + СвободныйТовар);
		 Возврат Ложь;
	 КонецЕсли;
	 Возврат Истина;
 КонецФункции
 
 
 &НаКлиенте
 Процедура ЗарезервированныеТоварыКоличествоПриИзменении(Элемент)
	 СтрокаТабличнойЧасти = Элементы.ЗарезервированныеТовары.ТекущиеДанные;
	 ТоварДляПоиска = СтрокаТабличнойЧасти.НаименованиеТовара;
	 КоличествоДляРезерва = СтрокаТабличнойЧасти.Количество;
	 СкладДляРезервирования = Объект.Склад;
	 ХватаетТовара = ЗарезервированныеТоварыКоличествоПриИзмененииНаСервере(ТоварДляПоиска, КоличествоДляРезерва,СкладДляРезервирования);
	 Если Не ХватаетТовара Тогда
		 СтрокаТабличнойЧасти.Количество = 0;
		 СтрокаТабличнойЧасти.Сумма = 0;
	 Иначе
		 РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
	 КонецЕсли;
 КонецПроцедуры
 
 &НаСервере
 Функция ЗарезервированныеТоварыНаименованиеТовараПриИзмененииНаСервере(ТоварДляПоискаЦены)
	 Запрос = Новый Запрос;
	 Запрос.текст = 
	 "ВЫБРАТЬ
	 |	ЦеныНаТоварыСрезПоследних.Номенклатура.Ссылка КАК НоменклатураСсылка,
	 |	ЦеныНаТоварыСрезПоследних.Период КАК Период,
	 |	ЦеныНаТоварыСрезПоследних.Цена КАК Цена
	 |ИЗ
	 |	РегистрСведений.ЦеныНаТовары.СрезПоследних КАК ЦеныНаТоварыСрезПоследних
	 |ГДЕ
	 |	ЦеныНаТоварыСрезПоследних.Номенклатура.Ссылка = &Товар
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ЦеныНаТоварыСрезПоследних.Номенклатура.Ссылка,
	 |	ЦеныНаТоварыСрезПоследних.Период,
	 |	ЦеныНаТоварыСрезПоследних.Цена";
	 Запрос.УстановитьПараметр("Товар",ТоварДляПоискаЦены);
	 РезультатЗапроса = Запрос.Выполнить();
	 ТаблицаИзЗапроса = РезультатЗапроса.Выгрузить();
	 Цена = ТаблицаИзЗапроса.Итог("Цена");
	 Возврат Цена;
 КонецФункции
 
 &НаКлиенте
 Процедура ЗарезервированныеТоварыНаименованиеТовараПриИзменении(Элемент) 
	 СтрокаТабличнойЧасти = Элементы.ЗарезервированныеТовары.ТекущиеДанные;
	 ТоварДляПоискаЦены = СтрокаТабличнойЧасти.НаименованиеТовара;
	 Цена = ЗарезервированныеТоварыНаименованиеТовараПриИзмененииНаСервере(ТоварДляПоискаЦены);
	 СтрокаТабличнойЧасти.Цена = Цена;
 КонецПроцедуры
