
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ЦеныНаТовары.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Товар = ТекСтрокаТовары.НаименованиеТовара;
		Движение.Количество = ТекСтрокаТовары.Количество; 
		
		Движение = Движения.ЦеныНаТовары.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.НаименованиеТовара;
		Движение.Цена = ТекСтрокаТовары.Цена;
	КонецЦикла;
КонецПроцедуры
